# Inserting Records from CSV File

In [1]:
import sqlite3

In [2]:
db=sqlite3.connect("C:\SQLiteData\marks_database.db")

#Declare cursor
cursor=db.cursor()

In [3]:
# Create Table
cursor.execute("CREATE TABLE marks(gender TEXT,student_id INT PRIMARY KEY,marks INT)")

In [4]:
with open('Scores_file.csv','r') as file:
    total_records=0
    for row in file:
        cursor.execute("insert into marks values(?,?,?)",row.split(","))
        db.commit()
        total_records+=1
print(total_records,'Records inserted')

18 Records inserted

In [7]:
result = cursor.execute("SELECT * FROM marks")
for row in result:
    print(row)

('Male', 104, 56)
('Male', 105, 57)
('Female', 106, 89)
('Female', 107, 67)
('Male', 108, 58)
('Female', 109, 99)
('Male', 110, 69)
('Female', 111, 46)
('Male', 112, 34)
('Male', 113, 54)
('Male', 114, 49)
('Female', 115, 88)
('Female', 116, 38)
('Male', 117, 87)
('Male', 118, 86)
('Female', 119, 30)
('Female', 120, 44)
('Male', 121, 85)

In [9]:
sq1 = "SELECT * FROM marks WHERE student_id = 104"
result = cursor.execute(sq1)
for row in result:
    print(row)

('Male', 104, 56)

In [10]:
# How to change the order of records (Increasing or decreasing)
result = result = cursor.execute("SELECT * FROM marks ORDER BY marks desc")
for row in result:
    print(row)

('Female', 109, 99)
('Female', 106, 89)
('Female', 115, 88)
('Male', 117, 87)
('Male', 118, 86)
('Male', 121, 85)
('Male', 110, 69)
('Female', 107, 67)
('Male', 108, 58)
('Male', 105, 57)
('Male', 104, 56)
('Male', 113, 54)
('Male', 114, 49)
('Female', 111, 46)
('Female', 120, 44)
('Female', 116, 38)
('Male', 112, 34)
('Female', 119, 30)

In [11]:
# How to change the order of records (Increasing or decreasing)
result = result = cursor.execute("SELECT * FROM marks ORDER BY marks asc")
for row in result:
    print(row)

('Female', 119, 30)
('Male', 112, 34)
('Female', 116, 38)
('Female', 120, 44)
('Female', 111, 46)
('Male', 114, 49)
('Male', 113, 54)
('Male', 104, 56)
('Male', 105, 57)
('Male', 108, 58)
('Female', 107, 67)
('Male', 110, 69)
('Male', 121, 85)
('Male', 118, 86)
('Male', 117, 87)
('Female', 115, 88)
('Female', 106, 89)
('Female', 109, 99)

In [13]:
# Single Record update
sq1 = "UPDATE marks SET marks = 50 WHERE student_id = 107"
cursor.execute(sq1)

In [14]:
# Verify If its updated
result = cursor.execute("SELECT * FROM marks ORDER BY student_id")
for row in result:
    print(row)

('Male', 104, 56)
('Male', 105, 57)
('Female', 106, 89)
('Female', 107, 50)
('Male', 108, 58)
('Female', 109, 99)
('Male', 110, 69)
('Female', 111, 46)
('Male', 112, 34)
('Male', 113, 54)
('Male', 114, 49)
('Female', 115, 88)
('Female', 116, 38)
('Male', 117, 87)
('Male', 118, 86)
('Female', 119, 30)
('Female', 120, 44)
('Male', 121, 85)

In [15]:
# MIN
result = result = cursor.execute("SELECT MIN(marks) marks FROM marks")
print('Minimum Marks = ',result.fetchone())265441225667iy65465522222222222222222222222222222

Minimum Marks =  (30,)

In [16]:
# MIN
result = result = cursor.execute("SELECT MAX(marks) marks FROM marks")
print('Maximum Marks = ',result.fetchone())

Maximum Marks =  (99,)

In [55]:
db.close()

# Exercise 2 SQLite3

In [1]:
import sqlite3

Adding Data In Table

In [2]:
db=sqlite3.connect("C:/DATABASE/sports_database.db")

In [3]:
cur=db.cursor()

constraints  ------
unique -- enter only unique values ,no duplicate values
not null -- no blank values can be inserted in table

In [7]:
cur.execute("create table sport (id int primary key,sportname text unique,dateofevent date,country text not null)")

In [8]:
cur.execute("insert into sport values(1,'cricket','2021-11-9','England')")

#this line will throw error as sportname is duplicate  --- unique constraint failed

#cur.execute("insert into sport values(2,'cricket','2018-08-02,'SriLanka)")

In [9]:
cur.execute("insert into sport values(2,'Tennis','2018-08-02','SriLanka')")
print(cur.rowcount,"record(s) inserted")

1 record(s) inserted

In [13]:
results=cur.execute('select * from sport')

results.fetchall()

[(1, 'cricket', '2021-11-9', 'England'),
 (2, 'Tennis', '2018-08-02', 'SriLanka'),
 (3, 'Football', '2022-05-30', 'Australia')]

In [11]:
results =cur.execute("insert into sport values(3,'Football','2022-05-30','Australia')")
db.commit;

In [12]:
results=cur.execute('select * from sport')

results.fetchall()

[(1, 'cricket', '2021-11-9', 'England'),
 (2, 'Tennis', '2018-08-02', 'SriLanka'),
 (3, 'Football', '2022-05-30', 'Australia')]

#this query throw error : not null constraint : can not leave any field blank

#cur.execute(insert into sport values(3,'Football','2022-05-30','NULL'))

# Employee Database with DB and Python Programmatically

In [26]:
import sqlite3

In [27]:
con=sqlite3.connect("C:/SQLiteData/emp_database.db")

In [28]:
def sq1_table(con):
    cur=con.cursor()
    cur.execute("create table employee(id integer primary key,name text,salary real,department text,position text,hiredate date)")
    con.commit()

In [29]:
#calling function

sq1_table(con)

In [30]:
cur=con.cursor()
cur.execute("insert into employee values(1,'Jack',9000,'HR','Manager','2019-07-09')")

In [31]:
con.commit;

In [32]:
results=cur.execute('select * from employee')
results.fetchall()

[(1, 'Jack', 9000.0, 'HR', 'Manager', '2019-07-09')]

We can also pass values/arguments to an INSERT statement in the execute()method.You can use the ? as a placeholder for
each value.The syntax of the INSERT will be like the following:

cur.execute('''insert into employee(id,name,salary,department,position,hiredate) values(?,?,?,?,?,?)''',entities)

entities=(2,'John',4000,'IT','Engineer','2018-02-06')

In [33]:
def sq1_insert(con,entities):
    cur=con.cursor()
    cur.execute('insert into employee(id,name,salary,department,position,hiredate) values(?,?,?,?,?,?)',entities)

In [34]:
entities=(2,'Andrew',7000,'IT','Engineer','2015-04-06')

In [35]:
#calling sql insert to insert the data

sq1_insert(con,entities)

In [36]:
entities=(3,'Thomas',6000,'HR','Manager','2016-06-14')

In [37]:
sq1_insert(con,entities)

In [38]:
results=cur.execute('select * from employee')
results.fetchall()

[(1, 'Jack', 9000.0, 'HR', 'Manager', '2019-07-09'),
 (2, 'Andrew', 7000.0, 'IT', 'Engineer', '2015-04-06'),
 (3, 'Thomas', 6000.0, 'HR', 'Manager', '2016-06-14')]

In [39]:
entities=(4,'Rudolf',8000,'IT','Engineer','2012-08-23')

sq1_insert(con,entities)

entities=(5,'Suzen',10000,'Sales','Sales Executive','2018-02-19')

sq1_insert(con,entities)

In [40]:
results=cur.execute('select * from employee')
results.fetchall()

[(1, 'Jack', 9000.0, 'HR', 'Manager', '2019-07-09'),
 (2, 'Andrew', 7000.0, 'IT', 'Engineer', '2015-04-06'),
 (3, 'Thomas', 6000.0, 'HR', 'Manager', '2016-06-14'),
 (4, 'Rudolf', 8000.0, 'IT', 'Engineer', '2012-08-23'),
 (5, 'Suzen', 10000.0, 'Sales', 'Sales Executive', '2018-02-19')]

In [41]:
results=cur.execute("select id,name from employee")
results.fetchall()

[(1, 'Jack'), (2, 'Andrew'), (3, 'Thomas'), (4, 'Rudolf'), (5, 'Suzen')]

In [42]:
results=cur.execute("select id,name from employee where salary >8000")
results.fetchall()

[(1, 'Jack'), (5, 'Suzen')]

In [43]:
results=cur.execute("select id,name from employee where department in ('HR')")
results.fetchall()

[(1, 'Jack'), (3, 'Thomas')]

In [44]:
results=cur.execute("select min(salary) from employee")
results.fetchall()

[(6000.0,)]

In [45]:
results=cur.execute("select count(id) from employee")
results.fetchall()

[(5,)]

In [46]:
results=cur.execute("select distinct(department) from employee")
results.fetchall()

[('HR',), ('IT',), ('Sales',)]

In [47]:
results=cur.execute("select count(distinct(department)) from employee")
results.fetchall()

[(3,)]

In [48]:
results=cur.execute("select sum(salary), position from employee group by position")
results.fetchall()

[(15000.0, 'Engineer'), (15000.0, 'Manager'), (10000.0, 'Sales Executive')]

In [49]:
results=cur.execute("select sum(salary), position from employee group by department")
results.fetchall()

[(15000.0, 'Manager'), (15000.0, 'Engineer'), (10000.0, 'Sales Executive')]

In [52]:
def sq1_query(sq1):
    cur=con.cursor()
    results=cur.execute(sq1)
    return results

In [53]:
#make query 
sq1="select * from employee"

#pass query in function
respond=sq1_query(sq1)
respond.fetchall()

[(1, 'Jack', 9000.0, 'HR', 'Manager', '2019-07-09'),
 (2, 'Andrew', 7000.0, 'IT', 'Engineer', '2015-04-06'),
 (3, 'Thomas', 6000.0, 'HR', 'Manager', '2016-06-14'),
 (4, 'Rudolf', 8000.0, 'IT', 'Engineer', '2012-08-23'),
 (5, 'Suzen', 10000.0, 'Sales', 'Sales Executive', '2018-02-19')]

In [54]:
sq1="select id,name,position from employee"

#pass query in function
respond=sq1_query(sq1)
respond.fetchall()

[(1, 'Jack', 'Manager'),
 (2, 'Andrew', 'Engineer'),
 (3, 'Thomas', 'Manager'),
 (4, 'Rudolf', 'Engineer'),
 (5, 'Suzen', 'Sales Executive')]